openfoam/arc_M1.6_finvol/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
#include "../constant/freestreamProperties"
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pInf;

boundaryField
{
    "(inlet|outlet|farfield)"
    {
        type            characteristicFarfieldPressure;
        U               $UInf;
        p               $pInf;
        T               $TInf;
        value           $internalField;
    }
    fuselage
    {
        type            characteristicWallPressure;
        value           $internalField;
    }
    stabilizers
    {
        type            characteristicWallPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
